In [ ]:
'''
This is part 1 of naive bayes classifier algorithm machine learning tutorial. 
Naive bayes theorm uses bayes theorm for conditional probability with a 
naive assumption that the features are not correlated to each other and 
tries to find conditional probability of target variable given the probabilities of features. 
'''

In [1]:
import pandas as pd
df = pd.read_csv('https://storage.googleapis.com/kagglesdsdata/competitions/3136/26502/train.csv?GoogleAccessId=web-data@kaggle-161607.iam.gserviceaccount.com&Expires=1646132661&Signature=PteVGgxccUCBs%2FsS7tCMNObj%2B6Svdf23ERl7SVnvVns2y4B7yPqW3mYYNQazGsbpEF6P0KUiKysl5ZTjIZEuNI%2FdduFeY77DWHdNVWZGDd5TlizWxOPd1E2rHcOyYpavsCr1OgtjLU8HpTCDsHhTb9kpzGoSK0Dzf2iFgh7HNWCsUYbHjCK9OAn6IBITg%2BZpn2KagdtPMFR3QWDeQV5kHlpsG9j8DaPdQGyJcZBC%2B8zuqz2UM6tknZp20fVDjtWR5ZvklfjzDpWGVtKxZfpFQlAv4f3udqF%2F%2F1j2zXFUcUXiD6tFdDR40rcNTL%2BVDJnUeNFHX4%2F7XbprMuToqMgpqQ%3D%3D&response-content-disposition=attachment%3B+filename%3Dtrain.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [3]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
# merged

inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
# I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female

inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [8]:
inputs.columns[inputs.isna().any()] #detect missing data

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean()) # fill the NaN with mean value
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

# Naive Bayes Classifier Algorithm

In [20]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [21]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [22]:
len(X_train)

623

In [23]:
len(X_test)

268

In [24]:
len(inputs)

891

In [29]:
model.fit(X_train,y_train)

GaussianNB()

In [30]:
model.score(X_test,y_test)

0.7350746268656716

In [27]:
X_test[0:10]

     Pclass        Age      Fare  female
734       2  23.000000   13.0000       0
454       3  29.699118    8.0500       0
325       1  36.000000  135.6333       1
609       1  40.000000  153.4625       1
135       2  23.000000   15.0458       0
690       1  31.000000   57.0000       0
597       3  49.000000    0.0000       0
816       3  23.000000    7.9250       1
639       3  29.699118   16.1000       0
472       2  33.000000   27.7500       1

In [28]:
y_test[0:10]

734    0
454    0
325    1
609    1
135    0
690    1
597    0
816    0
639    0
472    1
Name: Survived, dtype: int64

In [31]:
model.predict(X_test[0:10])

array([0, 0, 1, 1, 0, 0, 0, 1, 0, 1])

In [32]:
model.predict_proba(X_test[:10])

array([[9.38620660e-01, 6.13793397e-02],
       [9.73613672e-01, 2.63863281e-02],
       [1.32724244e-04, 9.99867276e-01],
       [1.79105671e-05, 9.99982089e-01],
       [9.38603358e-01, 6.13966420e-02],
       [6.40603573e-01, 3.59396427e-01],
       [9.68231531e-01, 3.17684687e-02],
       [3.83335546e-01, 6.16664454e-01],
       [9.73924782e-01, 2.60752178e-02],
       [2.24973857e-01, 7.75026143e-01]])

# Calculate the score using cross validation

In [33]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.784     , 0.808     , 0.784     , 0.76612903, 0.82258065])